'''
Две простые игры
Two simple games
'''


import random
from time import sleep

def FirstGame():
    var = random.randint(1, 100)
    print("  Я загадал число от 1, до 100. Ваша задача - угадать его.")
    while True:
        try:
            last = int(input())
            if last == var:
                print("  Поздравляю, вы угадали!")
                break
            if last > var:
                print("  Ваше число больше задуманного.")
            if last < var:
                print("  Ваше число меньше задуманного.")
        except: print("  Ваше число может содержать ТОЛЬКО цифры.")

    sleep(1)

def SecondGame():
    var = random.randint(1, 100)
    print("  Загадайте число от 1 до 100. Моя задача - угадать его")
    sleep(1.5)
    print("  Если я угадаю ваше число, то напишите \"угадал\".")
    sleep(1)
    print(f"  Я думаю, что это число {var}.")
    print("  Ваше число больше или меньше моего? (больше/меньше)")
    min = 1
    max = 100
    answer = str(input())
    while True:
        if answer == "угадал":
            print("  Ура!")
            break
        else:
            if max - min != 0:
                if answer == "больше":
                    if max == var:
                        print("  Вы наверное ошиблись. Повторите пожалуйста.")
                        print(f"  Я думаю, что это число {var}.")
                    else:
                        min = var+1
                        var = random.randint(min, max)
                        print(f"  Я думаю, что это число {var}.")
                if answer == "меньше":
                    if min == var:
                        print("  Вы наверное ошиблись. Повторите пожалуйста.")
                        print(f"  Я думаю, что это число {var}.")
                    else:
                        max = var-1
                        var = random.randint(min, max)
                        print(f"  Я думаю, что это число {var}.")
            else:
                print(f"  Я уверен, это число {var}.")
                break

        answer = str(input())
    sleep(1)

variable = 0
print("  ***************************************************************************************************************")
print("  *  ______   ___    ___   _______    _______    _______        __    __    ________    _______        __       *")
print("  * |   ___|  \  \  /  /  |   _   |  |   ____|  |   __  |      |  | /   |  |   _____|  |   __  |      /  \\      *")
print("  * |  |       \  \/  /   |  | |  |  |  |____   |  |__| |      |  |/ |  |  |  |        |  |__| |     /    \\     *")
print("  * |  |        \    /    |  | |  |  |   ____|  |   ____|      |    /|  |  |  |        |   ____|    /  /\  \\    *")
print("  * |  |___      /  /     |  | |  |  |  |____   |  |           |   / |  |  |  |        |  |        /   __   \\   *")
print("  * |______|    /__/      |__| |__|  |_______|  |__|           |__/  |__|  |__|        |__|       /__/    \__\\  *")
print("  *                                                                                                             *")
print("  ***************************************************************************************************************")
sleep(1)
print("  Добро пожаловать в Супер Игру.")
sleep(1)
print("  Есть две игры.")
sleep(1)
print("  1 - Число загадывает машина.")
sleep(1)
print("  2 - Число загадываете Вы.")
sleep(1)
print("  Во что хотите сыграть? (1/2) ")
number = int(input())
while True:
    print("  Во что хотите сыграть? (1/2) ")
    number = int(input())
    if number == 1:
        FirstGame()
    if number == 2:
        SecondGame()












'''
 ______   ___    ___   _______    _______    _______        __    __    ________    _______        __  
|   ___|  \  \  /  /  |   _   |  |   ____|  |   __  |      |  | /   |  |   _____|  |   __  |      /  \
|  |       \  \/  /   |  | |  |  |  |____   |  |__| |      |  |/ |  |  |  |        |  |__| |     /    \
|  |        \    /    |  | |  |  |   ____|  |   ____|      |    /|  |  |  |        |   ____|    /  /\  \   
|  |___      /  /     |  | |  |  |  |____   |  |           |   / |  |  |  |        |  |        /   __   \
|______|    /__/      |__| |__|  |_______|  |__|           |__/  |__|  |__|        |__|       /__/    \__\

___    ___
\  \  /  /
 \  \/  /
  \    /
   /  /
  /__/

 _______
|   _   | 
|  | |  |
|  | |  | 
|  | |  |
|__| |__|

 _______  
|   ____|
|  |____
|   ____|    
|  |____
|_______|


 _______  
|   __  |
|  |__| |
|   ____|    
|  |
|__|


 __    __  
|  | /   |
|  |/ |  |
|    /|  |
|   / |  |
|__/  |__|


 ________  
|   _____|
|  |
|  |
|  |
|__|

 _______  
|   __  |
|  |__| |
|   ____|    
|  |
|__|


     __  
    /  \
   /    \
  /  /\  \  
 /   __   \
/__/    \__\


'''